base/Catalogs/бит_мпд_ЭлементыТаблицПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_мпд_ЭлементыТаблицПроизвольныхОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_НастройкиПроизвольныхОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСортировки</Name>
					<Comment>Код сортировки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_мпд_ВидыЭлементовТаблицПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ТаблицыПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЯчейки</Name>
					<Comment>Вид ячейки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЯчеекПроизвольногоОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьДвиженияПоБюджету</Name>
					<Comment>Формировать движения по бюджету</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДанных</Name>
					<Comment>Период данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДанных</Name>
					<Comment>Элемент данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПоУмолчанию</Name>
					<Comment>Значения по умолчанию</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Comment>Имя аналитики</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Comment>Аналитика</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Comment>Значение аналитики</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аргументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементТаблицы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_мпд_ЭлементыТаблицПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыЯчеекПроизвольногоОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыЯчеекПроизвольногоОтчета</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шаблон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_мпд_ВидыЭлементовТаблицПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_мпд_ВидыЭлементовТаблицПроизвольныхОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Колонка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_мпд_ЭлементыТаблицПроизвольныхОтчетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Алгоритм = "Итог";
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Вид") И ДанныеЗаполнения.Свойство("Владелец") Тогда		
			КодСортировки = Справочники.бит_мпд_ЭлементыТаблицПроизвольныхОтчетов.МаксимальныйКодСортировки(ДанныеЗаполнения.Владелец, ДанныеЗаполнения.Вид)+10;
		КонецЕсли;
	КонецЕсли; 
		
	Если НЕ ЗначениеЗаполнено(ВидЯчейки) Тогда		
		ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение;		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда	
		Возврат; 	
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
		
		// Проверим, что добавление элемента не приведет к пересечению таблиц.
		МассивОписаний = Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПолучитьТаблицыОтчета(Владелец);
		
		// Скорректируем описание текущей таблицы с учетом внесенных изменений.
		Сч = 0;
		Для каждого ОписаниеТаблицы Из МассивОписаний Цикл
			
			Если ОписаниеТаблицы.ТаблицаОтчета = ТаблицаОтчета Тогда
				
				ТекШирина = ОписаниеТаблицы.Ширина;
				ТекВысота = ОписаниеТаблицы.Высота;
				
				Если Вид = Перечисления.бит_мпд_ВидыЭлементовТаблицПроизвольныхОтчетов.Колонка Тогда					
					ТекШирина = ТекШирина + 1;					
				КонецЕсли; 
				
				Если Вид = Перечисления.бит_мпд_ВидыЭлементовТаблицПроизвольныхОтчетов.Строка Тогда					
					ТекВысота = ТекВысота + 1;					
				КонецЕсли; 
				
				ОписаниеТекТаблицы = Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПодготовитьОписаниеТаблицы(ТаблицаОтчета, 
																											   ТекШирина, ТекВысота);
				МассивОписаний[Сч] = ОписаниеТекТаблицы;
				Прервать;
				
			КонецЕсли; 
			
			Сч = Сч + 1;
		КонецЦикла; 
		
		Если Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПроверитьПересечения(МассивОписаний, Истина) Тогда			
			ТекстСообщения = НСтр("ru='Запись изменений невозможна из-за пересечения таблиц.';
								  |en='Record of changes is possible due to the intersection table.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);			
		КонецЕсли; 
		
	КонецЕсли; // ЭтоНовый()
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти
	
#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
